#+TITLE: Basics of Categories and Morphisms
#+AUTHOR: Aidan Pace
#+EMAIL: apace@defrecord.com
#+DATE: 2025-05-11
#+PROPERTY: header-args:scheme :results output :exports both :eval yes :noweb yes :tangle yes

#+PROPERTY: header-args:mermaid :file ../images/diagrams/:results file :exports both
#+OPTIONS: toc:3 num:3 
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

# Tangle destination for Scheme code
#+PROPERTY: tangle-dir "../src/generated/"

** Loading the Category Module

First, let's load our category theory module:

#+NAME: module-loading
#+begin_src scheme :tangle ../src/generated/basics-module.scm :mkdirp yes
(add-to-load-path "../src/guile")
(use-modules (category))

(display "Category theory module loaded successfully.\n")
#+end_src

#+RESULTS:
: ;;; compiling ../src/guile/category.scm
: ;;; compiled /home/aygp-dr/.cache/guile/ccache/3.0-LE-8-4.6/home/aygp-dr/projects/aygp-dr/strange-loop-cat/src/guile/category.scm.go
: Category theory module loaded successfully.

